Cats_99/app/controllers/cats_controller.rb

    def index
        @c = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @c = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]